{
    "language_code": "en_GB",
    "language_info": "English",
    "show_navigation": "Show navigation",
    "hide_navigation": "Hide navigation",
    "home": "home",
    "about": "about",
    "resume": "resume",
    "works": "works",
    "testimonials": "testimonials",
    "homeTitle":"I'm Aniello Tortora.",
    "homeDescription": "I'm an Italy based @web @developer, @project @manager and @web @designer creating awesome and effective websites and web applications for companies of all sizes around the globe. Let's @start @scrolling and learn more @about @me in mine @ReactJS based resume.",
    "about_me": "About Me",
    "about_me_description": "I'm Aniello, an Italian web developer, project manager, and web designer. I love to create awesome and effective websites and web applications for companies of all sizes around the globe. I'm an undergraduate in Computer Science.#I've ten years of experience in software development, and I usually spend my time doing research and working in the field of IT to continue to grow. I started to work before my university career. I've started with programming languages such as c, java, and Php.#I've been programming since 2012. In the beginning, I created my first website for a company, and I worked as a freelancer during my college time. In 2017 I worked for an enterprise company, and in 2018 I became the head developer of that company.#When I've understood that computer science was my real passion and not only a job, I've left the previous school moving to computer science university and at the same time, I've continued to work on a lot of projects alone or as internal. At the beginning of 2019, I've applied to the Red Square Team.#In most of the projects I was assigned to, I had the freedom to manage the project and to lead my colleagues until I officially became a project manager within the team. However, this did not move me away from programming the most important and critical tasks were assigned to me, as well as the creation of styles as I can faithfully emulate or create an element from a properly designed model. I'm also involved as a lead developer of several other project at the moment. I always look for perfect, effective, and practical solutions to any potential problem. I love the challenges that programming offers",
    "contact_details": "Contact Details",
    "downlload_resume": "Download English Resume",
    "education": "Education",
    "education_elements": [
        {
            "name": "University of Salerno",
            "state": "Undergraduate in Computer Science",
            "date": "April 2022"
        },
        {
            "name": "Red Square Team",
            "state": "Preparation course",
            "date": "Febraury 2019"
        },
        {
            "name": "I.T.I.S. G. Marconi",
            "state": "High School Diploma",
            "date": "Febraury 2016"
        }
    ],
    "work": "work",
    "work_elements": [
        {
            "name": "Red Square Team",
            "role": "Senior Developer",
            "date_start": "January 2019",
            "date_to": "Present",
            "description": "The R.S.T. is a team of freelancers who work together to manage multiple projects of various entities at the same time, each has its main area of ​​work, but at the same time everyone can do everything. Specifically, I deal with the development of the frontend with the creation of styles and all the graphic and functional elements, subsequently I connect everything with the server if it has already been created by my colleagues, but in the case of smaller projects I also take care of the server and the database."
        },
        {
            "name": "Proxt s.a.s.",
            "role": "Head Developer",
            "date_start": "March 2017",
            "date_to": "October 2018",
            "description": "Proxt s.a.s. is a small local company that had set itself the goal of digitizing Italian stores to expand the online market and the possibility of meeting and booking professionals of all kinds through the Joomap app. My assumption made this possible, initially, the app was developed using ionic 1, finished the first version I rewrote the app in ionic 3 adding all the functionality necessary for publication."
        },
        {
            "name": "Website Developer",
            "role": "Freelancer",
            "date_start": "January 2011",
            "date_to": "Febraury 2017",
            "description": "At the age of 14, I started making websites using html, php, js and css, until then I had dedicated myself to cms. Gradually I got more and more interesting projects and bigger and bigger challenges that led me to love more and more the world of programming, until the day I received my first contract as a programmer as an intern in a company, and thanks to my previous career I was immediately qualified as a senior developer, my skills of self-management and team management have allowed me to almost always have a role as a project manager in team work"
        }
    ],
    "skills": "skills",
    "skills_description": "In my career I have had the opportunity to work in different teams and to develop different projects, each of them with its own peculiarities, and these experiences over the years have allowed me to develop my sklills more and more.",
    "check_out_works": "Check out some of my works.",
    "works_elements": [
        {
            "name": "Place Me",
            "role": "Full Stack Developer",
            "description": "Created all the elements and the functionaly of the platform, including payments function",
            "icon": "images/portfolio/placeme.png",
            "image": "images/portfolio/modals/placeme.png",
            "details": "https://www.youtube.com/watch?v=Z2goznvD23k",
            "used": [
                "reactjs",
                "bootstrap",
                "js",
                "css",
                "graphql",
                "sequelize"
            ]
        },
        {
            "name": "Ease",
            "role": "Full Stack Developer",
            "description": "Debugged, resolved some critical bugs on both client and server, added some new features",
            "icon": "images/portfolio/ease.png",
            "image": "images/portfolio/modals/ease.png",
            "details": "http://dashboard.itsease.com/",
            "used": [
                "reactjs",
                "nodejs",
                "js",
                "css",
                "apollo",
                "web development",
                "sequelize"
            ]
        },
        {
            "name": "Azeroth Shard Launcher",
            "role": "Programmer",
            "description": "Merged Electron and React, Electron is used for all the O.S. interation, React for the Frontend",
            "icon": "images/portfolio/as.png",
            "image": "images/portfolio/modals/as.png",
            "details": "https://github.com/AzerothShard/get-as-launcher/releases/latest",
            "used": [
                "reactjs",
                "bootstrap",
                "js",
                "css",
                "electronjs",
                "github api"
            ]
        },
        {
            "name": "Joomap",
            "role": "App Developer",
            "description": "Created the android/ios app using Angular and Cordova",
            "icon": "images/portfolio/joomap.png",
            "image": "images/portfolio/modals/joomap.png",
            "details": "https://www.youtube.com/watch?v=ROBsv2StBSM",
            "used": [
                "angularjs",
                "cordova",
                "ionic v1",
                "ionic v3",
                "css",
                "scss",
                "jquery",
                "rest api"
            ]
        }
    ],
    "details": "Details",
    "close": "Close",
    "client_testimonials": "Client Testimonials",
    "testimonials_elements": [
        {
            "from":"Joseph Roy (on Linkedin)",
            "description": "Aniello has extreme knowledge of UI developing and a very fast learning curve of new technologies"
        }
    ]
}